## Day 13

- Сегодня пришлось день поработать на нормальной работе, поздним вечером засел побаловаться чисто и про API почитать. Посмотрел днем видос с еще одним мнением про вышку, придало еще больше мыслей что мне оно надо, потому что я намылился в этом году на магистратуру поступить за много денег. Документы уже подаю, но буду думать. [my biggest career mistake - university](https://www.youtube.com/watch?v=-VbdVEOxiOc)

- Отправил свой первый в жизни багрепорт. Не знаю как это оценивать, что-то между "разглашение персональных данных вообще всех" и "прописано в правилах программы что они это не принимают". Будет очень интересно конечно если примут.

- Замечаю что очень интересно устроен мыслительный процесс: пока смотрю видео или занимаюсь какими-то своими делами где-то на фоне крутится мысль о мобильном приложении которое я пытаюсь ломануть, и уже после того как я отдохнул - в голову приходят новые идеи о том с какой стороны подойти ко взлому. Ничего не ломается в итоге, но меня поражает эта механика того как мозг устроен: пока ты сидишь и ломаешь голову над задачей- решения не приходят, но когда отдыхаешь - эта инфа переваривается.

- Смотрю видосы про api, занимаюсь на tryhackme, пью пиво и кайфую. Жизнь хороша.